winwill2012/SmartRelay/firmware/sdkconfig.defaults
# SmartRelay — ESP-IDF v5.5.4（ESP32-C3 + WiFi + NimBLE + MQTT）
CONFIG_IDF_TARGET="esp32c3"

# 与常见 4MB Flash 硬件一致（避免 header 2MB / 芯片 4MB 告警）
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y

CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# SmartRelay runtime config (override per environment)
CONFIG_SR_LOG_PROFILE_DEV=y
CONFIG_SR_FW_VERSION="1.0.7"
CONFIG_SR_MQTT_HOST="127.0.0.1"
CONFIG_SR_MQTT_PORT=1883
CONFIG_SR_MQTT_USER="SmartRelay"
CONFIG_SR_MQTT_PASS="change_me"
